%%%%%%%%%%%%%%%%% 影视工程系数字图像处理课程实验： 开运算和闭运算%%%%%%%%%%%%%%%%%%%%%%%%
clear;
I=imread('test.bmp');%输入图像
I2=rgb2gray(I);%转化为灰度图像
I3 = im2bw(I2);%转化为2值图像
subplot(1,3,1),imshow(I3);title('原图');
se2 = strel('disk', 20,0);%生成结构元素se2  % length 30, angle 90 degrees
c = imerode(I3,se2);   %图像腐蚀
subplot(1,3,2),imshow(c);title('腐蚀')
x=I3-c;%图像相减
subplot(1,3,3),imshow(x);title('开运算')




%%%%%%%%%%%%思考题： 说明开运算和闭运算对原图的变换结果和区别，说明图像相减后的边缘检测效果与前半课程中的边缘检测有何区别？

%%%开运算会获得图形的内边缘，闭运算会获得图形的外边缘。相减后的边缘检测效果更平滑，且描边宽度可以调整